docs/a07/index.tex
% Created 2025-04-28 Mon 12:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{parskip}
\author{Raghav B. Venkataramaiyer}
\date{Mar '25}
\title{Assignment 07 : YOLO\\\medskip
\large UTA027 : Artificial Intelligence}
\hypersetup{
 pdfauthor={Raghav B. Venkataramaiyer},
 pdftitle={Assignment 07 : YOLO},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle
A07 : Object Detection with YOLO
5-May/12-May


\section{Introduction}
\label{sec:org64c8cc6}
\subsection{Background}
\label{sec:orgbf8c81b}

Object detection is a computer vision technique that
identifies and locates objects within images or
videos.   It goes beyond image classification by drawing
bounding boxes around detected objects, enabling
machines to "see" and understand their
environment.   This is crucial for applications like
autonomous driving, surveillance, robotics, and medical
imaging, where identifying object locations is
essential for decision-making and automation.

The YOLO (You Only Look Once) family is a popular
series of object detection models known for their speed
and efficiency.  YOLOv8 is a cutting-edge version that
offers state-of-the-art performance.

YOLO models are particularly well-suited for this task
because they process the entire image in a single pass
through the neural network.  This design choice makes
them significantly faster than other object detection
methods, enabling real-time performance.  Despite their
speed, YOLO models, especially YOLOv8, achieve high
accuracy, making them ideal for applications requiring
both speed and precision.

\subsection{Learning Objectives}
\label{sec:orgba18a2f}
\begin{enumerate}
\item Understand the YOLO architecture.
\item Set up a development environment for YOLO.
\item Prepare a dataset for YOLO training.
\item Train a pre-trained YOLO model on a custom dataset.
\item Evaluate the performance of a trained YOLO model.
\item Perform object detection on images/videos using the
trained model.
\end{enumerate}
\subsection{Dataset}
\label{sec:org11ca06c}
Use the Pascal \href{http://host.robots.ox.ac.uk/pascal/VOC/}{VOC Dataset} which is available off the
shelf with both PyTorch and TensorFlow ecosystem.

The PASCAL VOC dataset is a standard dataset for object detection tasks. It defines a specific set of object classes that models are trained to detect. The classes in the PASCAL VOC dataset are:

\begin{description}
\item[{Person}] \texttt{person}
\item[{Animal}] \texttt{bird}, \texttt{cat}, \texttt{cow}, \texttt{dog}, \texttt{horse},
\texttt{sheep}
\item[{Vehicle}] \texttt{aeroplane}, \texttt{bicycle}, \texttt{boat}, \texttt{bus},
\texttt{car}, \texttt{motorbike}, \texttt{train}
\item[{Indoor}] \texttt{bottle}, \texttt{chair}, \texttt{dining table}, \texttt{potted
  plant}, \texttt{sofa}, \texttt{tv/monitor}
\end{description}

Dataset preparation and annotation are crucial for the
PASCAL VOC dataset's effectiveness in training robust
object detection models. High-quality annotations,
including accurate bounding boxes and class labels,
enable models to learn precise object locations and
categories. Consistent annotation across the dataset
ensures that models generalize well to unseen images.

Proper dataset preparation, such as splitting the data
into training, validation, and test sets, is essential
for evaluating model performance and preventing
over-fitting.

\subsection{Software and Libraries}
\label{sec:orgfa50c46}
\begin{enumerate}
\item Python 3.x
\item PyTorch or TensorFlow (specify which framework to
use)
\item \texttt{torchvision} (if using PyTorch) or
\texttt{tensorflow-datasets} (if using TensorFlow)
\item \texttt{ultralytics} (if using YOLOv5 or v8) or other
relevant libraries.
\item Suggest using a GPU for training (and how to set up
in Google Colab, if needed).
\end{enumerate}
\section{Tasks}
\label{sec:org3f35c6e}
\subsection{Task 1: Setting up the Environment (10\%)}
\label{sec:orgf0d521a}
\begin{enumerate}
\item Provide detailed instructions on setting up the
environment. This should include:
\begin{itemize}
\item Installing Python and pip.
\item Installing PyTorch/TensorFlow (with GPU support if
available).
\item Installing the necessary libraries (e.g.,
ultralytics).
\end{itemize}
\item If using Colab, provide a link to a starter notebook
with the basic setup.
\item Include a small test to verify that the environment
is set up correctly (e.g., running a simple YOLO
command).
\end{enumerate}
\subsection{Task 2: Data Preparation (25\%)}
\label{sec:org303a035}
\begin{enumerate}
\item Explain the YOLO dataset format. This is crucial!
YOLO requires specific formatting of the annotation
files.
\item Provide instructions on how to:
\begin{itemize}
\item Download the dataset.
\item Convert the dataset to the YOLO format (if
necessary). Provide code snippets or scripts if
possible.
\item Organize the dataset into training and validation
sets.
\end{itemize}
\item If students are using a dataset that needs
conversion, point them to tools or scripts that can
automate this process.
\item Explain data augmentation techniques (e.g., random
flips, rotations, scaling) and how to apply them
using the chosen library. (Emphasize why
augmentation is important).
\end{enumerate}
\subsection{Task 3: Training the YOLO Model (40\%)}
\label{sec:org85f5a29}
\begin{enumerate}
\item Provide starter code or commands to train a
pre-trained YOLO model on the prepared dataset.
\item Explain the key training parameters:
\begin{itemize}
\item epochs
\item batch size
\item learning rate
\item Optimizer (e.g., Adam, SGD)
\item Weight decay
\end{itemize}
\item Explain how to monitor the training process (loss
curves, mAP).
\item Encourage students to experiment with different
hyperparameters to improve performance. Ask them to
document their experiments.
\item Include instructions on how to save the trained
model weights.
\end{enumerate}
\subsection{Task 4: Model Evaluation (15\%)}
\label{sec:org436269a}
\begin{enumerate}
\item Explain the evaluation metrics for object detection:
\begin{itemize}
\item Precision
\item Recall
\item Intersection over Union (IoU)
\item Mean Average Precision (mAP)
\end{itemize}
\item Provide code or instructions on how to calculate
these metrics on the validation set.
\item Ask students to analyze the results and discuss the
model's strengths and weaknesses.
\item Require students to include a confusion matrix, if
applicable, and explain what it shows.
\end{enumerate}
\subsection{Task 5: Inference and Visualization (10\%)}
\label{sec:orgea16ae2}
\begin{enumerate}
\item Provide instructions on how to use the trained model
to detect objects in new images or videos.
\item Explain how to visualize the results:
\begin{itemize}
\item Drawing bounding boxes around detected objects.
\item Displaying class labels and confidence scores.
\end{itemize}
\item Ask students to provide examples of the model's
output on test images or videos.
\end{enumerate}
\section{Submission}
\label{sec:org420e200}
\begin{itemize}
\item[{$\square$}] Specify the files to be submitted:
\begin{itemize}
\item[{$\square$}] Code files (Python scripts or Jupyter
Notebooks)
\item[{$\square$}] A report (in PDF format) that includes:
\begin{itemize}
\item[{$\square$}] Introduction
\item[{$\square$}] Methodology (explaining the data preparation,
training process, and evaluation methods)
\item[{$\square$}] Results (including tables and figures showing
the evaluation metrics)
\item[{$\square$}] Discussion (analyzing the results, discussing
challenges, and suggesting future improvements)
\end{itemize}
\end{itemize}
\item[{$\square$}] Trained model weights.
\item[{$\square$}] Specify the submission deadline and any
formatting requirements.
\end{itemize}
\section{Grading Rubric}
\label{sec:orgc82ee25}
\begin{itemize}
\item[{$\square$}] Provide a detailed grading rubric. For example:
\begin{itemize}
\item[{$\square$}] Task 1: Setting up the Environment: 10\%
\item[{$\square$}] Task 2: Data Preparation: 25\%
\item[{$\square$}] Task 3: Training the YOLO Model: 40\%
\item[{$\square$}] Task 4: Evaluation: 15\%
\item[{$\square$}] Task 5: Inference and Visualization: 10\%
\item[{$\square$}] Report Quality (clarity, organization,
completeness): 10\%
\end{itemize}
\end{itemize}
\section{Additional Tips for Students}
\label{sec:orgc301748}
\begin{itemize}
\item Provide links to relevant documentation and
tutorials.
\item Encourage them to use version control (Git) to manage
their code.
\item Suggest using a consistent coding style.
\item Remind them to comment their code clearly.
\end{itemize}
\end{document}
